Revit 2027 API
ViewOrientation3D Constructor
 Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewOrientation3D(
	XYZ eyePosition,
	XYZ upDirection,
	XYZ forwardDirection
)
Public Sub New (
	eyePosition As XYZ,
	upDirection As XYZ,
	forwardDirection As XYZ
)
public:
ViewOrientation3D(
	XYZ^ eyePosition,
	XYZ^ upDirection,
	XYZ^ forwardDirection
)
new :
        eyePosition : XYZ *
        upDirection : XYZ *
        forwardDirection : XYZ -> ViewOrientation3D
Parameters
eyePosition XYZ
 The eye position
upDirection XYZ
 The up direction. This vector will be normalized. Up direction must be perpendicular to the forward direction.
forwardDirection XYZ
 The forward direction. This vector will be normalized. Forward direction must be perpendicular to the up direction.
Exceptions
Exception | Condition
ArgumentException |  One or both of the input vectors cannot be normalized.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  upDirection has zero length. -or- forwardDirection has zero length.
ArgumentsInconsistentException |  The vectors upDirection and forwardDirection are not perpendicular.
See Also
Reference
ViewOrientation3D Class
Autodesk.Revit.DB Namespace